## Staging: system_status_static_site
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
```terraform
Plan: 0 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| update | `module.system_status_static_site[0].aws_s3_bucket.this`              |
|        | `module.system_status_static_site[0].aws_s3_bucket_policy.oai_policy` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.system_status_static_site[0].data.aws_iam_policy_document.s3_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "s3_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-staging-system-status/*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EWPJ3VM2FRDOR",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.system_status_static_site[0].aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      ~ force_destroy               = false -> true
        id                          = "notification-canada-ca-staging-system-status"
        tags                        = {}
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.system_status_static_site[0].aws_s3_bucket_policy.oai_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "oai_policy" {
        id     = "notification-canada-ca-staging-system-status"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EWPJ3VM2FRDOR"
                        }
                      - Resource  = "arn:aws:s3:::notification-canada-ca-staging-system-status/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

